In [1]:
import numpy as np
import pandas as pd

In [2]:
outside=['g1','g1','g1','g2','g2','g2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [3]:
hier_index

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 1),
            ('g2', 2),
            ('g2', 3)],
           )

In [5]:
df=pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [6]:
df

             A         B
g1 1 -0.086611 -1.251245
   2  0.890698 -1.935039
   3  0.114177  0.341677
g2 1  0.869161  0.530274
   2 -0.307535 -1.323431
   3 -1.020381  0.501368

In [7]:
df.loc['g1']

          A         B
1 -0.086611 -1.251245
2  0.890698 -1.935039
3  0.114177  0.341677

In [8]:
df.loc['g1'].loc[1]

A   -0.086611
B   -1.251245
Name: 1, dtype: float64

In [9]:
df.index.names

FrozenList([None, None])

In [10]:
df.index.names=['groups','num']

In [11]:
df

                   A         B
groups num
g1     1   -0.086611 -1.251245
       2    0.890698 -1.935039
       3    0.114177  0.341677
g2     1    0.869161  0.530274
       2   -0.307535 -1.323431
       3   -1.020381  0.501368

In [12]:
df.loc['g2'].loc[2]['B']

-1.3234310059732932

In [13]:
#xs->cross section
df.xs('g1')

            A         B
num
1   -0.086611 -1.251245
2    0.890698 -1.935039
3    0.114177  0.341677

In [14]:
df.xs(1,level='num')

               A         B
groups
g1     -0.086611 -1.251245
g2      0.869161  0.530274

## pandas-missing data

In [1]:
import numpy as np
import pandas as pd

In [2]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [3]:
df=pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()#by default it drop rows which contain nan ,, for column the axis should be 1

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [8]:
#thresh-> contain atleast non nan value that it is given
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.fillna(value=10)

      A     B  C
0   1.0   5.0  1
1   2.0  10.0  2
2  10.0  10.0  3

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## pandas - groupby

In [1]:
#groupby allow you to group together rows based off a column and perform an aggregate together
import numpy as np
import pandas as pd

In [6]:
data={'company':['goog','goog','msft','msft','fb','fb'],
     'person':['sam','charlie','amy','venessa','car1','sarah'],
     'sales':[200,120,340,124,243,350]}

In [7]:
df=pd.DataFrame(data)

In [8]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  venessa    124
4      fb     car1    243
5      fb    sarah    350

In [11]:
d=df.groupby('company')

In [13]:
d.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [14]:
d.sum()

         sales
company
fb         593
goog       320
msft       464

In [15]:
d.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [16]:
d.sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [17]:
df.groupby('company').sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [18]:
df.count()

company    6
person     6
sales      6
dtype: int64

In [19]:
df.groupby('company').count()

         person  sales
company
fb            2      2
goog          2      2
msft          2      2

In [20]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [21]:
df.groupby('company').describe().transpose()

company              fb        goog        msft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## merging , joining , and concatenating
####       ways to combining dataframe

In [37]:
import pandas as pd

In [38]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['BO','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D2','D3','D3']},
               index=[0,1,2,3])

In [39]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
               index=[4,5,6,7])

In [40]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
               index=[8,9,10,11])

In [41]:
df1

    A   B   C   D
0  A0  BO  C0  D0
1  A1  B1  C1  D2
2  A2  B2  C2  D3
3  A3  B3  C3  D3

In [42]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [43]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [44]:
#concatenation
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   BO   C0   D0
1    A1   B1   C1   D2
2    A2   B2   C2   D3
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [36]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8    A8   B8   C8   D8  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9    A9   B9   C9   D9  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  A10  B10  C10  D10  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  A11  B11  C11  D11  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [45]:
left = pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [46]:
left

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [47]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [48]:
#merging
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

In [53]:
left = pd.DataFrame({'key1':['k0','k0','k1','k2'],
                     'key2':['k0','k1','k0','k1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key1':['k0','k1','k1','k2'],
                     'key2':['k0','k0','k0','k0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [54]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [55]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k1   A3   B3  NaN  NaN
5   k2   k0  NaN  NaN   C3   D3

In [56]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   k0   k0   A0   B0  C0  D0
1   k1   k0   A2   B2  C1  D1
2   k1   k0   A2   B2  C2  D2
3   k2   k0  NaN  NaN  C3  D3

In [57]:
right

  key1 key2   C   D
0   k0   k0  C0  D0
1   k1   k0  C1  D1
2   k1   k0  C2  D2
3   k2   k0  C3  D3

In [59]:
#joining
left=pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                  index=['ko','k1','k2'])
right=pd.DataFrame({'C':['C0','C1','C2'],
                    'D':['D0','D1','D2']},
                  index=['ko','k2','k3'])

In [60]:
left.join(right)

     A   B    C    D
ko  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C1   D1

In [61]:
left

     A   B
ko  A0  B0
k1  A1  B1
k2  A2  B2

In [62]:
right

     C   D
ko  C0  D0
k2  C1  D1
k3  C2  D2

In [63]:
right.join(left)

     C   D    A    B
ko  C0  D0   A0   B0
k2  C1  D1   A2   B2
k3  C2  D2  NaN  NaN

In [64]:
left.join(right,how='outer')

      A    B    C    D
k1   A1   B1  NaN  NaN
k2   A2   B2   C1   D1
k3  NaN  NaN   C2   D2
ko   A0   B0   C0   D0

In [65]:
left.join(right)

     A   B    C    D
ko  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C1   D1

## pandas - operation

In [66]:
import numpy as np
import pandas as pd

In [67]:
df=pd.DataFrame({'col1':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [68]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [69]:
len(df['col2'].unique())

3

In [71]:
df['col2'].nunique()

3

In [72]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [74]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [75]:
df['col2']>0

0    True
1    True
2    True
3    True
Name: col2, dtype: bool

In [76]:
def times2(x):
    return x*2

In [81]:
#apply method
df['col1'].sum()

10

In [77]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [82]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [83]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [85]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [86]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [87]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [88]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [89]:
data={'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
     'C':['x','y','x','y','x','y'],
     'D':[1,3,2,5,4,1]}

In [90]:
df=pd.DataFrame(data)

In [99]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [97]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1